jq8718/P4SCAN/sdkconfig.defaults
# ESP32-P4 Function EV Board defaults
# Flash: 16MB GD25Q128ES1G, mode DIO, 80MHz
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: 4MB octal, use external memory for large allocations
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_SPEED_20M=y
# CONFIG_SPIRAM_SPEED_200M is not set

# ESP32-P4 Function EV Board + SC2336 over MIPI-CSI
CONFIG_EXAMPLE_SELECT_ESP32P4_FUNCTION_EV_BOARD_V1_5=y
CONFIG_EXAMPLE_ENABLE_MIPI_CSI_CAM_SENSOR=y
CONFIG_EXAMPLE_MIPI_CSI_SCCB_I2C_PORT=0
CONFIG_EXAMPLE_MIPI_CSI_SCCB_I2C_FREQ=100000
CONFIG_CAMERA_SC2336=y
# CONFIG_CAMERA_SC2336_MIPI_RAW8_1280X720_30FPS is not set
# CONFIG_CAMERA_SC2336_MIPI_RAW8_1024X600_30FPS is not set
# CONFIG_CAMERA_SC2336_MIPI_RAW8_1920X1080_30FPS is not set
# CONFIG_CAMERA_SC2336_MIPI_RAW8_800X800_30FPS is not set
CONFIG_CAMERA_SC2336_MIPI_RAW10_640X480_50FPS=y
# CONFIG_CAMERA_SC2336_MIPI_RAW10_800X800_30FPS is not set
# CONFIG_CAMERA_SC2336_MIPI_RAW10_1280X720_30FPS is not set
# CONFIG_CAMERA_SC2336_MIPI_RAW10_1920X1080_25FPS_2_LANE is not set
CONFIG_CAMERA_SC2336_MIPI_DEFAULT_FMT_RAW10_640X480_50FPS=y

# Video pipeline: SC2336 RAW -> hardware JPEG -> USB Video Class
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_HW_H264_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_HW_JPEG_ENC_VIDEO_DEVICE=y
CONFIG_FORMAT_MJPEG_CAM1=y
# CONFIG_FORMAT_H264_CAM1 is not set
CONFIG_UVC_MODE_BULK_CAM1=y
# CONFIG_UVC_MODE_ISOC_CAM1 is not set
# CONFIG_FRAMESIZE_SVGA is not set
CONFIG_FRAMESIZE_VGA=y
# CONFIG_FRAMESIZE_HD is not set
# CONFIG_FRAMESIZE_FHD is not set
CONFIG_UVC_CAM1_FRAMERATE=2
CONFIG_UVC_CAM1_FRAMESIZE_WIDTH=640
CONFIG_UVC_CAM1_FRAMESIZE_HEIGT=480
# CONFIG_UVC_CAM1_MULTI_FRAMESIZE is not set
CONFIG_EXAMPLE_JPEG_COMPRESSION_QUALITY=30
# CONFIG_P4SCAN_UVC_TEST_PATTERN is not set
CONFIG_EXAMPLE_H264_BITRATE=1000000
CONFIG_EXAMPLE_H264_I_PERIOD=120
CONFIG_EXAMPLE_H264_MIN_QP=25
CONFIG_EXAMPLE_H264_MAX_QP=26

# Required by esp_video on ESP32-P4.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_EXAMPLE_DISABLE_USB_MSC_STORAGE=y
